In [1]:
import pandas as pd

In [27]:
info = {'one' :pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([11,22,33],index=['a','b','c')}

In [3]:
df = pd.DataFrame(info)
df

   one  two
a    1   11
b    2   22
c    3   33

In [4]:
df['three'] = pd.Series([111,222,333],index=['a','b','c'])
df['three']

a    111
b    222
c    333
Name: three, dtype: int64

In [11]:
df['four'] = df['one']+df['three']

In [8]:
df

   one  two  three
a    1   11    111
b    2   22    222
c    3   33    333

In [12]:
df['four']

a    112
b    224
c    336
Name: four, dtype: int64

In [13]:
info = {'one' :pd.Series([1,2,3],index=['a','b','c']),
        'two' :pd.Series([1,2,3],index=['a','b','c'])}

In [14]:
df = pd.DataFrame(info)

In [17]:
print("The Data Frame")
df

The Data Frame

   one  two
a    1    1
b    2    2
c    3    3

In [18]:
print("Delete the First column")
del df['one']
df

Delete the First column

   two
a    1
b    2
c    3

In [19]:
print("delete Another Column")
df.pop('two')
df

delete Another Column

Empty DataFrame
Columns: []
Index: [a, b, c]

In [20]:
#Adding Rows (one data frams with another Data Frame)
d1 = pd.DataFrame([[11,22],[13,14]],columns=['x','y'])

In [21]:
d2 = pd.DataFrame([[31,32],[43,54]],columns=['x','y'])

In [22]:
d = d1.append(d2)
d

    x   y
0  11  22
1  13  14
0  31  32
1  43  54

In [23]:
#Adding Column
Data = {'name' :['aman','akash','Divya','Ram','shyam'],
        'course' :['b.tech','mba','bba','bca','ba'],
        'roll' :[1,2,3,4,5,]}
df = pd.DataFrame(Data)
df

    name  course  roll
0   aman  b.tech     1
1  akash     mba     2
2  Divya     bba     3
3    Ram     bca     4
4  shyam      ba     5

In [25]:
address = ['Noida','Munger','Lkr','Patna','Delhi']
df['address']=address
df

    name  course  roll address
0   aman  b.tech     1   Noida
1  akash     mba     2  Munger
2  Divya     bba     3     Lkr
3    Ram     bca     4   Patna
4  shyam      ba     5   Delhi

In [31]:
info = {'one' :pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([11,22,33],index=['a','b','d'])}
df = pd.DataFrame(info)
df

   one   two
a  1.0  11.0
b  2.0  22.0
c  3.0   NaN
d  NaN  33.0